/**
 * @description Payment request, Response code hash table.
 * @module module:PaymentRequestResCode
 */
module.exports = {
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'0': 'تراکنش موفق',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'3': '‫امور‬ ‫بخش‬ ‫با‬ ‫لطفا‬ ‫نیست‬ ‫فعال‬ ‫کارت‬ ‫يرنده‬ ‫(پذ‬ ‫‪Invalid‬‬ ‫‪merchant‬‬\n' +
		'‫فرمائید)‬ ‫حاصل‬ ‫تماس‬ ‫پذيرندگان‪،‬‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'23': '‫پذيرندگان‪،‬‬ ‫تماس‬ ‫حاصل‬ ‫‪Merchant‬‬‫فرمائید)‬ ‫‪Inactive‬‬ ‫(پذيرنده‬ ‫کارت‬ ‫نامعتبر‬ ‫است‬ ‫لطفا‬ ‫با‬ ‫بخش‬ ‫امور‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'58': '‫انجام‬ ‫تراکنش‬ ‫مربوطه‬ ‫توسط‬ ‫پايانه‬ ‫ی‬ ‫انجام‬ ‫دهنده‬ ‫مجاز‬ ‫نمی‬ ‫باشد‬ ‫‪.‬‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'61': '‫مبل‬ ‫غ‬ ‫تراکنش‬ ‫از‬ ‫حد‬ ‫مجاز‬ ‫باالتر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1000': '‫تماس‬ ‫حاصل‬ ‫ترتیب‬‫فرمايند‬ ‫پارامترهای‬ ‫ارسالی‬ ‫اشتباه‬ ‫می‬ ‫باشد‪،‬‬ ‫لطفا‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1001': '‫اشتباه‬ ‫می‬ ‫لطفا‬‫باشد‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬ ‫فرمايند‪،‬پارامترهای‬ ‫پرداخت‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1002': '‫خطا‬ ‫در‬ ‫سیس‬ ‫تم‬ ‫‪-‬‬ ‫تراکنش‬ ‫ناموفق‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1003': '‫‪IP‬‬‫فرمايند‬ ‫پذيرنده‬ ‫اشتباه‬ ‫است‪.‬لطفا‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1004': '‫اشتباه‬ ‫لطفا‬‫است‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬ ‫فرمايند‪،‬شماره‬ ‫پذيرنده‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1005': '‫خطای‬ ‫دسترسی‪:‬لطفا‬ ‫بعدا‬ ‫تالش‬ ‫فرمايید‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1006': '‫خطا‬ ‫در‬ ‫سیستم‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1011': '‫درخواست‬ ‫تکراری‬ ‫‪-‬‬ ‫شماره‬ ‫سفارش‬ ‫تکراری‬ ‫می‬ ‫باشد‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1012': '‫اشتباه‬ ‫است‪.‬لطفا‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬ ‫اطالعات‬‫فرمايند‬ ‫پذيرنده‬ ‫صحیح‬ ‫نیست‪،‬يکی‬ ‫از‬ ‫موارد‬ ‫تاريخ‪،‬زمان‬ ‫يا‬ ‫کلید‬ ‫تراکنش‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1015': '‫پاسخ‬ ‫خطای‬ ‫نامشخص‬ ‫از‬ ‫سمت‬ ‫مرکز‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1017': '‫پذيرنده‬ ‫بیشتر‬ ‫مبلغ‬‫است‬ ‫درخواس‬ ‫تی‬ ‫شما‬ ‫جهت‬ ‫پرداخت‬ ‫از‬ ‫حد‬ ‫مجاز‬ ‫تعريف‬ ‫شده‬ ‫برای‬ ‫اين‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1018': '‫هماهنگ‬ ‫اشکال‬‫نمايید‬ ‫در‬ ‫تاريخ‬ ‫و‬ ‫زمان‬ ‫سیستم‪.‬‬ ‫لطفا‬ ‫تاريخ‬ ‫و‬ ‫زمان‬ ‫سرور‬ ‫خود‬ ‫را‬ ‫با‬ ‫بانک‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1019': '‫امکان‬ ‫پرداخت‬ ‫از‬ ‫طريق‬ ‫سیستم‬ ‫شتاب‬ ‫برای‬ ‫اين‬ ‫پذيرنده‬ ‫امکان‬ ‫پذير‬ ‫نیست‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1020': '‫پذيرنده‬ ‫غی‬ ‫رفعال‬ ‫شده‬ ‫است‪.‬لطفا‬ ‫جهت‬ ‫فعال‬ ‫سازی‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫بگیريد‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1023': '‫آدرس‬ ‫بازگشت‬ ‫پذيرنده‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1024': '‫مهر‬ ‫زمانی‬ ‫پذيرنده‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1025': '‫امضا‬ ‫تراکنش‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1026': '‫شماره‬ ‫سفارش‬ ‫تراکنش‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1027': '‫شماره‬ ‫پذيرنده‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1028': '‫شماره‬ ‫ترمینال‬ ‫پذيرنده‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1029': '‫نیست‬ ‫‪.‬لطفا‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬ ‫آدرس‬‫فرمايند‬ ‫‪IP‬‬ ‫پرداخت‬ ‫در‬ ‫محدوده‬ ‫آدرس‬ ‫های‬ ‫معتبر‬ ‫اعالم‬ ‫شده‬ ‫توسط‬ ‫پذيرنده‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1030': '‫پذيرن‬ ‫ده‬ ‫نیست‬ ‫‪.‬لطفا‬ ‫مسئول‬ ‫فنی‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬ ‫آدرس‬‫فرمايند‬ ‫‪Domain‬‬ ‫پرداخت‬ ‫در‬ ‫محدوده‬ ‫آدرس‬ ‫های‬ ‫معتبر‬ ‫اعالم‬ ‫شده‬ ‫توسط‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1031': '‫بفرمايید‬ ‫مهلت‬‫‪.‬‬ ‫زمانی‬ ‫شما‬ ‫جهت‬ ‫پرداخت‬ ‫به‬ ‫پايان‬ ‫رسیده‬ ‫است‪.‬لطفا‬ ‫مجددا‬ ‫سعی‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1032': '‫کارتهای‬ ‫مجاز‬ ‫که‬ ‫توسط‬ ‫پذيرنده‬ ‫معرفی‬ ‫شده‬ ‫است‬ ‫‪.‬‬ ‫استفاده‬ ‫پرداخت‬‫نمايید‪.‬‬ ‫با‬ ‫اين‬ ‫کارت‬ ‫‪.‬‬ ‫برای‬ ‫پذيرنده‬ ‫مورد‬ ‫نظر‬ ‫شما‬ ‫امکان‬ ‫پذير‬ ‫نیست‪.‬لطفا‬ ‫از‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1033': '‫است‪.‬لطفا‬ ‫مسوول‬ ‫فنی‬ ‫سايت‬ ‫پذيرنده‬ ‫با‬ ‫بانک‬ ‫تماس‬ ‫حاصل‬ ‫به‬‫فرمايند‪.‬‬ ‫علت‬ ‫مشکل‬ ‫در‬ ‫سايت‬ ‫پذيرنده‪.‬‬ ‫پرداخت‬ ‫برای‬ ‫اين‬ ‫پذيرنده‬ ‫غیرفعال‬ ‫شده‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1036': '‫اطالعات‬ ‫اضافی‬ ‫ارسال‬ ‫نشده‬ ‫يا‬ ‫دارای‬ ‫اشکال‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1037': '‫شماره‬ ‫پذيرنده‬ ‫يا‬ ‫شماره‬ ‫ترمی‬ ‫نال‬ ‫پذيرنده‬ ‫صحیح‬ ‫نمیباشد‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1053': '‫پذيرنده‬ ‫خود‬ ‫را‬ ‫چک‬ ‫خطا‪:‬‬‫کنید‪.‬‬ ‫درخواست‬ ‫معتبر‪،‬‬ ‫از‬ ‫سمت‬ ‫پذيرنده‬ ‫صورت‬ ‫نگرفته‬ ‫است‬ ‫لطفا‬ ‫اطالعات‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1055': '‫مقدار‬ ‫غیرمجاز‬ ‫در‬ ‫ورود‬ ‫اطالعات‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1056': '‫سیستم‬ ‫موقتا‬ ‫قطع‬ ‫میباشد‪.‬لطفا‬ ‫بعدا‬ ‫تالش‬ ‫فرمايید‪.‬‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1058': '‫سرويس‬‫بفرمايید‪.‬‬ ‫پرداخت‬ ‫اينترنتی‬ ‫خارج‬ ‫از‬ ‫سرويس‬ ‫می‬ ‫باشد‪.‬لطفا‬ ‫بعدا‬ ‫سعی‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1061': '‫عملیات‬‫مرورگر)‬ ‫پرداخت‬ ‫را‬ ‫انجام‬ ‫دهید‬ ‫(احتمال‬ ‫استفاده‬ ‫از‬ ‫دکمه‬ ‫«‬ ‫‪Back‬‬ ‫اشکال‬‫»‬ ‫در‬ ‫تولید‬ ‫کد‬ ‫يکتا‪.‬‬ ‫لطفا‬ ‫مرورگر‬ ‫خود‬ ‫را‬ ‫بسته‬ ‫و‬ ‫با‬ ‫اجرای‬ ‫مجدد‬ ‫مرورگر‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1064': '‫لطفا‬ ‫مجددا‬ ‫سعی‬ ‫بفرمايید‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1065': '‫ارتباط‬ ‫ناموف‬ ‫ق‬ ‫‪.‬لطفا‬ ‫چند‬ ‫لحظه‬ ‫ديگر‬ ‫مجددا‬ ‫سعی‬ ‫کنید‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1066': '‫سیستم‬ ‫سرويس‬ ‫دهی‬ ‫پرداخت‬ ‫موقتا‬ ‫غیر‬ ‫فعال‬ ‫شده‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1068': '‫با‬ ‫عرض‬ ‫پوزش‬ ‫به‬ ‫علت‬ ‫بروزرسانی‬ ‫‪.‬‬ ‫سیستم‬ ‫موقتا‬ ‫قطع‬ ‫میباشد‪.‬‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1072': '‫خطا‬ ‫در‬ ‫پردازش‬ ‫پارامترهای‬ ‫اختیاری‬ ‫پذيرنده‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1101': '‫مبلغ‬ ‫تراکنش‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1103': '‫توکن‬ ‫ارسالی‬ ‫نامعتبر‬ ‫است‬',
		/**
		 * @memberOf module:PaymentRequestResCode
		 */
		'1104': '‫اطالعات‬ ‫تسهیم‬ ‫صحیح‬ ‫نیست‬',
}
